[
  {
    "title": "Texas Chainsaw Massacre",
    "key": 1,
    "producer": "Brian Tallerico",
    "rating": 4,
    "description": "It’s clear as day that the producers of “Texas Chainsaw Massacre” saw David Gordon Green’s 2018 reboot of “Halloween” and thought they could accomplish the same kind of comeback for Leatherface. Once again, there’s a sequel that skips all the previous films and remakes but the first movie, and it’s designed to center the story of a survivor. In this case, it’s Sally Hardesty (Olwen Fouéré, replacing Marilyn Burns, who passed in 2014), the only person who made it out alive in Tobe Hooper’s earth-shaking original. She’s been trying to find the creature who killed her friends for years, and the Netflix Original sets them against each other. Sorta. Just barely. Everything about David Blue Garcia’s film is “sorta just barely” (other than the gore, which is impressive). It’s one of those projects that’s clearly been through the wringer in terms of production—there were stories of a replaced directing team and horrible test screenings—and yet it feels like it was doomed from the beginning. It’s a startling misfire, a movie that fundamentally fails at almost everything it’s trying to do. Leatherface deserves better.",
    "uri": "https://s3.amazonaws.com/static.rogerebert.com/uploads/review/primary_image/reviews/texas-chainsaw-massacre-movie-review-2022/texas-chainsaw-massacre-movie-review-2022.jpeg"
  },
  {
    "title": "Ted K",
    "key": 2,
    "producer": "Christy Lemire",
    "rating": 3,
    "description": "“Ted K” trumpets its authentic bona fides early, informing us in an opening crawl that it was shot on the actual Montana land where Ted Kaczynski’s 10-by-12-foot cabin once stood, where he lived his spartan life and crafted the manifesto that would earn him the moniker The Unabomber. We also learn that director Tony Stone and his co-writers, Gaddy Davis and John Rosenthal, used Kaczynski’s own words from his 25,000 pages of writing to build their script.",
    "uri": "https://s3.amazonaws.com/static.rogerebert.com/uploads/review/primary_image/reviews/ted-k-movie-review-2022/ted-k-movie-review-2022.jpeg"
  },
  {
    "title": "Strawberry Mansion",
    "key": 3,
    "producer": "Sheila O'Malley",
    "rating": 4,
    "description": "Strawberry Mansion takes place in 2035, and 2035 doesn't look all that different from now, although there are some new-fangled technological developments. Consumer-driven algorithms, in concert with powerful state-run advertising agencies, infiltrate people's dreams, via a little air stick hooked up beside the bed. The air stick tallies up everything seen and experienced in dreams, all of which is taxable. In addition, advertisers can now get to you in your dreams, and commercials are woven into the fabric of the unconscious and subconscious worlds. It would be like getting all the Super Bowl commercials downloaded directly into your subconscious without your consent (kind of like that time in 2014 when Apple decided every iTunes subscriber wanted the new U2 album, whether they purchased it or not).",
    "uri": "https://s3.amazonaws.com/static.rogerebert.com/uploads/review/primary_image/reviews/strawberry-mansion-movie-review-2022/strawberry-mansion-movie-review-2022.jpeg"
  },
  {
    "title": "Breaking Bread",
    "key": 4,
    "producer": "Peter Sobczynski",
    "rating": 3,
    "description": "Breaking Bread tries to serve as an embodiment of the Anthony Bourdain quote that opens it: “Food may not be the answer to world peace, but it’s a start.” Is it possible that the simple but essential act of preparing food could be the thing that helps accomplish the seemingly impossible task of bringing peace to the Middle East at last? That is the question at the center of the new documentary “Breaking Bread,” and while it may sound impossibly naïve when put bluntly into words, filmmaker Beth Elise Hawk makes a reasonably good case for it with her likable, if somewhat slight, documentary. The result may be food porn, but it's food porn with a social conscience to go along with the drool-inducing close-ups of glorious-looking meals on display throughout.",
    "uri": "https://s3.amazonaws.com/static.rogerebert.com/uploads/review/primary_image/reviews/breaking-bread-movie-review-2022/BreakingBread_CMG_3.jpg"
  },
  {
    "title": "King Knight",
    "key": 5,
    "producer": "Tomris Laffly",
    "rating": 1,
    "description": "Aimless, immature, and frustratingly amateurish, Richard Bates’ “King Knight” feels like it was made exclusively for those involved in it, with no regard for an audience’s patience or time. Why else would this farcical, quasi-dark comedy set in some heightened version of the real world have such an alienatingly slight sense of humor? You might crack a polite smile or two throughout the film’s elongated running time and unsightly visuals that hammer on a hardly revolutionary point: Be yourself, no matter how ridiculous or strange others might think you are. But you are more likely to turn the whole weird fest off before the film’s main plot kicks in.",
    "uri": "https://s3.amazonaws.com/static.rogerebert.com/uploads/review/primary_image/reviews/king-knight-movie-review-2022/king-knight-movie-review-2022.jpeg"
  }
]
